import React from 'react';


// 1. Замена всех отрицательных чисел
// Есть массив из чисел `[2, -2, 0.1, 0, 0, -10, -9.9, -0.5, 0.3, 0.003, 2]`.
// Напиши код,
// который все отрицательные значения элементов массива заменит на нолик.
// В итоге должно получиться: `[2, 0, 0.1, 0, 0, 0, 0, 0, 0.3, 0.003, 2]`.


/////////////////Решение///////////////////////
const mass = [2, -2, 0.1, 0, 0, -10, -9.9, -0.5, 0.3, 0.003, 2];

const mass2 = mass.map((item) => {
    if (item < 0) {
        return 0
    } return item;
})
console.log(mass2);
//////////////////////////////////////////////


//2. Избавляемся от близнецов
// Дан массив из объектов:
// `const elements = [`
//   `{ a: 2, b: 12 },`
//   `{ a: 0.1, b: 0.1 },`
//   `{ a: 0, b: 1 },`
//   `{ a: 100, b: 1000 },`
//   `{ a: 4, b: 4 }`
// `];`
//
// Обработай массив так,
// чтобы в итоге остались только те элементы,
// у которых значения свойств `a` и `b` не совпадают.


/////////////////Решение///////////////////////
const elements = [
    { a: 2, b: 12 },
    { a: 0.1, b: 0.1 },
    { a: 0, b: 1 },
    { a: 100, b: 1000 },
    {a: 4, b: 4}
];

const element = elements.filter((item) => {
    if ( item.a === item.b) {
        return false
    } return true
});

console.log(element);

////////////////////////////////////////////////

// 3. Поиск близнеца
//
// Напиши код,
// который в массиве из предыдущего задания найдет какого-нибудь близнеца
// и вернет сумму этих значений.

/////////////////Решение///////////////////////

const element2 = elements.find((item) => {
    if (item.a === item.b) {
        console.log(item.a + item.b)
    }
});


function Homework(props) {

    return (
        <div>

        </div>
    );
}

export default Homework;